"use strict"


// ================= 2 відео =================
//https://www.youtube.com/watch?v=5V8IeATHr4w&ab_channel=%D0%A4%D1%80%D1%96%D0%BB%D0%B0%D0%BD%D1%81%D0%B5%D1%80%D0%BF%D0%BE%D0%B6%D0%B8%D1%82%D1%82%D1%8E

console.log('Я вчу JS');

// варіант №1
// console.log('Вчимо JS')
// Помилку не викликає. Варто додати  крапку з комою.


// варіант №2
// console.log('JS')
// console.log('Вчимо')
// Помилку не викликає. Варто додати крапку з комою після кожної строки.

// варіант №3
// console.log('JS') console.log('Вчимо')

// Викликає помилку. Варто додати крапку з комою після кожного виразу.

// варіант №4
// console.log('Вчимо);
// console.log('JS');

// Викликає помилку. У першому виразі слово Вчимо не обгорнуто в лапки.

//=================3 відео===================
//https://www.youtube.com/watch?v=5V8IeATHr4w&ab_channel=%D0%A4%D1%80%D1%96%D0%BB%D0%B0%D0%BD%D1%81%D0%B5%D1%80%D0%BF%D0%BE%D0%B6%D0%B8%D1%82%D1%82%D1%8E

// 1. Придумати імя змінної для збереження кольору очей користувача сайту

let colorEyesUser;

/*
2. Обявити 2 змінних user  та userName. Привласнити значення "Вася" змінній userName.
Скопіюй значення змінної userName  в змінну user
Виведи в консоль змінну user. Результат має бути "Вася".
*/

// let user;
// let userName;
// userName = "Вася";
// user = userName;
// console.log(user);

// Варіант №1
// let user = "Вася" let age = 36
// Написано не вірно. Відсутня кома між виразами, ключове слово let другий раз не потрібно, в кінці має бути крапка з комою.

// Варіант №2
let myage = 36;
// Написано не вірно. Назва змінної записано не за правилами. Друге слово має бути з великої букви.

// Варіант №3
const BLOCK_SIZE = 14 + 50;
// console.log(BLOCK_SIZE);
// Написано не вірно.Оскільки це константа, значення якої присвоюється в процесі виконання програми назва має бути написана як змінні.


// Варіант №4
const BLOCK_HEIGHT = 100;

// Написано вірно.Для констант, що відомі зарання назва пишеться у верхньому регістрі та слова розділяються нижнім підчеркуванням.

// Варіант №5

if (true) {
	var size = 15;
}
console.log(size);

// Написано вірно. Якщо змінну було обявлено з допомогою ключогового слова var в блоці то з цією змінною можна працювати за межами блоку. В косоль виводиться цифра 15.



// ===================== 4 відео==================
// https://www.youtube.com/watch?v=g7jDucodUzQ&ab_channel=%D0%A4%D1%80%D1%96%D0%BB%D0%B0%D0%BD%D1%81%D0%B5%D1%80%D0%BF%D0%BE%D0%B6%D0%B8%D1%82%D1%82%D1%8E

// Варіант №1

let userAge = 36;
let userInfo = "Фрілансер ${userAge}";

// Не вірно. Для того, що додати до виразу змінну потрібно обгортати його в зворотні лапки ``.


// Варіант №2

let userHeight = 145 / 0;
// Повернеться значення NaN
console.log(userHeight);

// Не вірно. Повернеться значення Infinity


// Варіант №3

let userName;
// повернеться тип даних Null
console.log(typeof userName);

// Не вірно. Повернеться тип даних undefined

//Варіант №4

let userSize = "45" / "8";
//Повернеться тип даних number

console.log(typeof userSize);
//Вірно. Повернеться тип даних number